In [3]:
import pandas as pd
import numpy as np
import math
from heapq import nsmallest

In [4]:
data={'Name': ['Tom', 'nick', 'krish', 'jack','saira','sachin','rahul','pooja','laxmi','micheal'],
        'Age': [32, 40, 16, 18,30,23,55,40,15,21],'Gender':['Male','Male','Male','Male',"Female",'Male','Male','Female','Female','Male'
                    ],'Sport':["Football","Either","Cricket","Cricket","Neither","Cricket","Niether","Cricket","Football","Football"]}

In [5]:
df=pd.DataFrame(data)

In [6]:
X=df["Age"].tolist()

In [21]:
df

      Name  Age Gender     Sport  Final Distance
0      Tom   32      1  Football       27.018512
1     nick   40      1    Either       35.014283
2    krish   16      1   Cricket       11.045361
3     jack   18      1   Cricket       13.038405
4    saira   30      0   Neither       25.000000
5   sachin   23      1   Cricket       18.027756
6    rahul   55      1   Niether       50.009999
7    pooja   40      0   Cricket       35.000000
8    laxmi   15      0  Football       10.000000
9  micheal   21      1  Football       16.031220

In [8]:
df.iloc[[0,1,2,3,5,6,9],[2]] = 1
df.iloc[[4,7,8],[2]]=0

In [19]:
df

      Name  Age Gender     Sport  Final Distance
0      Tom   32      1  Football       27.018512
1     nick   40      1    Either       35.014283
2    krish   16      1   Cricket       11.045361
3     jack   18      1   Cricket       13.038405
4    saira   30      0   Neither       25.000000
5   sachin   23      1   Cricket       18.027756
6    rahul   55      1   Niether       50.009999
7    pooja   40      0   Cricket       35.000000
8    laxmi   15      0  Football       10.000000
9  micheal   21      1  Football       16.031220

In [10]:
## Very important code to replace the category values in present in the coulmn
for inx,row in df.iterrows():
    if row["Gender"]=="Male":
        df["Gender"].iloc[inx]=1
    elif row["Gender"]=="Female":
        df["Gender"].iloc[inx]=0
print(df["Gender"])

0    1
1    1
2    1
3    1
4    0
5    1
6    1
7    0
8    0
9    1
Name: Gender, dtype: object

In [11]:
Y=df["Gender"].tolist()

In [12]:
## To caluclate the distance between refernce data point and other data points (ref dp is (5,0))
Fd=[]
for inx in range(len(X)): 
    print(inx,X[inx])
    dist=(5-X[inx])**2+(0-Y[inx])**2
    finaldist=math.sqrt(dist)
    Fd.append(finaldist)
    
    print(finaldist)
df["Final Distance"]=Fd

0 32
27.018512172212592
1 40
35.014282800023196
2 16
11.045361017187261
3 18
13.038404810405298
4 30
25.0
5 23
18.027756377319946
6 55
50.00999900019995
7 40
35.0
8 15
10.0
9 21
16.0312195418814

In [13]:
df

      Name  Age Gender     Sport  Final Distance
0      Tom   32      1  Football       27.018512
1     nick   40      1    Either       35.014283
2    krish   16      1   Cricket       11.045361
3     jack   18      1   Cricket       13.038405
4    saira   30      0   Neither       25.000000
5   sachin   23      1   Cricket       18.027756
6    rahul   55      1   Niether       50.009999
7    pooja   40      0   Cricket       35.000000
8    laxmi   15      0  Football       10.000000
9  micheal   21      1  Football       16.031220

In [14]:
# Now look for 3 closed records to the reference data point 
 # laxmi, #Krish #jack, angelina is into cricket

In [15]:
df['Final Distance']

0    27.018512
1    35.014283
2    11.045361
3    13.038405
4    25.000000
5    18.027756
6    50.009999
7    35.000000
8    10.000000
9    16.031220
Name: Final Distance, dtype: float64

In [16]:
comp=df['Final Distance'].tolist()

In [17]:
print(comp)

[27.018512172212592, 35.014282800023196, 11.045361017187261, 13.038404810405298, 25.0, 18.027756377319946, 50.00999900019995, 35.0, 10.0, 16.0312195418814]

In [18]:
knearest_neighbors=[]
knearest_neighbors.append(nsmallest(3,comp))
print(knearest_neighbors)

[[10.0, 11.045361017187261, 13.038404810405298]]